In [12]:
#1 AYUSH KUMAR 18104031 B12
import pandas as pd
import io

df = pd.read_csv('Automobile_data.csv')

print(df.head(5))
print(df.tail(5))

   Unnamed: 0  index      company   body-style  wheel-base  length  \
0           0      0  alfa-romero  convertible        88.6   168.8
1           1      1  alfa-romero  convertible        88.6   168.8
2           2      2  alfa-romero    hatchback        94.5   171.2
3           3      3         audi        sedan        99.8   176.6
4           4      4         audi        sedan        99.4   176.6

  engine-type num-of-cylinders  horsepower  average-mileage    price
0        dohc             four         111               21  13495.0
1        dohc             four         111               21  16500.0
2        ohcv              six         154               19  16500.0
3         ohc             four         102               24  13950.0
4         ohc             five         115               18  17450.0
    Unnamed: 0  index     company body-style  wheel-base  length engine-type  \
56          56     81  volkswagen      sedan        97.3   171.7         ohc
57          57     82  volkswagen      sedan        97.3   171.7         ohc
58          58     86  volkswagen      sedan        97.3   171.7         ohc
59          59     87       volvo      sedan       104.3   188.8         ohc
60          60     88       volvo      wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

In [18]:
#2

import pandas as pd
import io
details = pd.read_csv("Automobile_data.csv", na_values=
{
'price':["?","n.a"],
'stroke':["?","n.a"],
'horsepower':["?","n.a"],
'peak-rpm':["?","n.a"],
'average-mileage':["?","n.a"]
})

print(details)

details.to_csv("Automobile_data.csv")

    Unnamed: 0  index      company   body-style  wheel-base  length  \
0            0      0  alfa-romero  convertible        88.6   168.8
1            1      1  alfa-romero  convertible        88.6   168.8
2            2      2  alfa-romero    hatchback        94.5   171.2
3            3      3         audi        sedan        99.8   176.6
4            4      4         audi        sedan        99.4   176.6
..         ...    ...          ...          ...         ...     ...
56          56     81   volkswagen        sedan        97.3   171.7
57          57     82   volkswagen        sedan        97.3   171.7
58          58     86   volkswagen        sedan        97.3   171.7
59          59     87        volvo        sedan       104.3   188.8
60          60     88        volvo        wagon       104.3   188.8

   engine-type num-of-cylinders  horsepower  average-mileage    price
0         dohc             four         111               21  13495.0
1         dohc             four         111               21  16500.0
2         ohcv              six         154               19  16500.0
3          ohc             four         102               24  13950.0
4          ohc             five         115               18  17450.0
..         ...              ...         ...              ...      ...
56         ohc             four          85               27   7975.0
57         ohc             four          52               37   7995.0
58         ohc             four         100               26   9995.0
59         ohc             four         114               23  12940.0
60         ohc             four         114               23  13415.0

[61 rows x 11 columns]

In [11]:
#3
import pandas as pd
df = pd.read_csv('Automobile_data.csv')

car_Manufacturers = df.groupby('company')
bmwDf = car_Manufacturers.get_group('bmw')
bmwDf

,Unnamed: 0,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
7,7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
8,8,10,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
9,9,11,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0
10,10,13,bmw,sedan,103.5,189.0,ohc,six,182,16,30760.0
11,11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
12,12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0

In [13]:
#4
import pandas as pd
import io
details = pd.read_csv('Automobile_data.csv')

details['company'].value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
mercedes-benz    4
audi             4
mitsubishi       4
volkswagen       4
jaguar           3
honda            3
isuzu            3
alfa-romero      3
porsche          3
chevrolet        3
volvo            2
dodge            2
Name: company, dtype: int64

In [17]:
#5
import pandas as pd
import io
details = pd.read_csv('Automobile_data.csv')
car_Manufacturers = details.groupby('company')

priceDf = car_Manufacturers['company','price'].max()
priceDf

<ipython-input-17-813ffee48f7d>:7: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  priceDf = car_Manufacturers['company','price'].max()

                     company    price
company
alfa-romero      alfa-romero  16500.0
audi                    audi  18920.0
bmw                      bmw  41315.0
chevrolet          chevrolet   6575.0
dodge                  dodge   6377.0
honda                  honda  12945.0
isuzu                  isuzu   6785.0
jaguar                jaguar  36000.0
mazda                  mazda  18344.0
mercedes-benz  mercedes-benz  45400.0
mitsubishi        mitsubishi   8189.0
nissan                nissan  13499.0
porsche              porsche  37028.0
toyota                toyota  15750.0
volkswagen        volkswagen   9995.0
volvo                  volvo  13415.0

In [16]:
#6
import pandas as pd
import io
details = pd.read_csv('Automobile_data.csv')
car_Manufacturers = details.groupby('company')

mileageDf = car_Manufacturers['company','average-mileage'].mean()
mileageDf

<ipython-input-16-215aae7a169e>:7: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  mileageDf = car_Manufacturers['company','average-mileage'].mean()

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

In [14]:
#7
import pandas as pd

Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
carPriceDf = pd.DataFrame.from_dict(Car_Price)

car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}
carsHorsepowerDf = pd.DataFrame.from_dict(car_Horsepower)

carsDf = pd.merge(carPriceDf, carsHorsepowerDf, on="Company")
carsDf

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160